"""
2. Выполнить логические побитовые операции "И", "ИЛИ" и др.
над числами 5 и 6. Выполнить
над числом 5 побитовый сдвиг вправо и влево на два знака.
"""

F_NUM = 5
S_NUM = 6

print(f'Даны числа {F_NUM} и {S_NUM}')
print(f'Логическое "И": {F_NUM}&{S_NUM} = {F_NUM & S_NUM}')
print(f'Логическое "ИЛИ": {F_NUM}|{S_NUM} = {F_NUM | S_NUM}')
print(f'Логическое "ИСКЛЮЧАЮЩЕЕ ИЛИ": {F_NUM}^{S_NUM} = {F_NUM ^ S_NUM}')
print(f'Логическое "ОТРИЦАНИЕ": ~{F_NUM} = {~F_NUM}')
print(f'Логическое "Сдвиг влево на 2 знака ": {F_NUM} << 2 = {F_NUM << 2}')
print(f'Логическое "Сдвиг вправо на 2 знака ": {F_NUM} >> 2 = {F_NUM >> 2}')

